// Пример 1

// Переприсваивание значений переменной
fn main() {
    let mut x = 5;
    println!("The value of x is: {}", x);
    x = 6;
    println!("The value of x is: {}", x);
}


// Пример 2

// Затенение
// Первый вывод покажет число 12, второй - 6.
// Дело в том, что во внутренней области видимости, созданной с помощью фигурных скобок,
// третий оператор let также затеняет x и создаёт новую переменную, умножая предыдущее значение
// на 2, чтобы дать x значение 12. Когда эта область заканчивается, внутреннее затенение
// заканчивается, и x возвращается к значению 6.
// fn main() {
//     let x = 5;
//
//     let x = x + 1;
//
//     {
//         let x = x * 2;
//         println!("The value of x in the inner scope is: {x}");
//     }
//
//     println!("The value of x is: {x}");
// }


// Пример 3

// Затенение позволяет изменять тип переменной. Если же при переприсваивании можно использовать
// только исходный тип данных, то при затенении можно спокойно менять типы данных
// fn main() {
//     let spaces = "   ";
//     let spaces = spaces.len();
// }