// 3. Используя хеш-карту и векторы, создайте текстовый интерфейс позволяющий пользователю добавлять 
// имена сотрудников к названию отдела компании. Например, "Add Sally to Engineering" или "Add Amir to Sales". 
// Затем позвольте пользователю получить список всех людей из отдела или всех людей в компании, 
// отсортированных по отделам в алфавитном порядке.


// Документация API стандартной библиотеки описывает методы у векторов, строк и HashMap. Рекомендуем 
// воспользоваться ей при решении упражнений.


fn main() {
    println!("Hello, world!");
}
