// 2. Преобразуйте строку в кодировку "поросячьей латыни" (Pig Latin). Первая согласная каждого слова 
// перемещается в конец и к ней добавляется окончание "ay", так "first" станет "irst-fay". Слову, 
// начинающемуся на гласную, в конец добавляется "hay" ("apple" становится "apple-hay"). Помните о деталях 
// работы с кодировкой UTF-8!


// Документация API стандартной библиотеки описывает методы у векторов, строк и HashMap. Рекомендуем 
// воспользоваться ей при решении упражнений.


fn main() {
    println!("Hello, world!");
}
