// 1. Есть список целых чисел. Создайте функцию, используйте вектор и верните из списка: среднее значение; 
// медиану (значение элемента из середины списка после его сортировки); моду списка (mode of list, то значение 
// которое встречается в списке наибольшее количество раз; HashMap будет полезна в данном случае).


// Документация API стандартной библиотеки описывает методы у векторов, строк и HashMap. Рекомендуем 
// воспользоваться ей при решении упражнений.


fn main() {
    println!("Hello, world!");
}
